Pandas inherits much of numpys ability to perform quick element-wise operations along with a couple useful twists. All numpy ufuncs will work on pandas series and dataframe objects

In [2]:
import pandas as pd
import numpy as np

rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [3]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

If a numpy ufunc is used on any of these objects, it will result in the creation of a new pandas object with the indexes preserved.

In [4]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [5]:
# A more complex calculation
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

For binary operations on two series or dataframe objects, pandas will align indices in the proces of performing the operation. This is convenient when working with incomplete data

Suppose we are combining two data sources and find only the top three US states by area and another top 3 US states by population:

In [10]:
area = pd.Series({
    'Alaska': 1723337, 
    'Texas': 695662,
     'California': 423967
}, name='area')

population = pd.Series({
    'California': 38332521, 
    'Texas': 26448193,            
    'New York': 19651127
}, name='population')

In [9]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

The resulting array contains a union of the two input arrays

A similar alignment takes place for both columns and indices when performing opeations on dataframes

In [11]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [12]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [13]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

Notice that the indeces are aligned correctly even though the order in the original was not